print('************表***************')
print('************数组***************')
-- 所有的复杂类型都是表
a = {1,2,3,'abc',nil,true,9,nil,nil}
print(a[2])
print(#a)
print('************数组的遍历***************')
for i = 1,#a do
print(a[i])
end
print('************二维数组***************')
b = {{1,2,3},{4,5,6}}
print(b[1][2])
print('************二维数组遍历***************')
for i = 1,#b do
    c = b[i]
    for j = 1,#c do
    print(c[j])
    end
end
print('************自定义索引***************')
d = {[-1] = -1,[0] = 0 ,[1] = 1,[2] = 2,[3] = 3,[5] = 5}
print(d[-1])
print(#d)
--print(d[1])
for i = 1,#d do
print(d[i])
end
